diplom-src/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ВКМ_ЗаполнениеГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_ЗаполнениеГрафика</name>
</mdclass:DataProcessor>

diplom-src/src/InformationRegisters/ВКМ_ГрафикиРаботы/ВКМ_ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ГрафикиРаботы</name>
  <resources>
    <name>ВКМ_Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

diplom-src/src/DataProcessors/ВКМ_ЗаполнениеГрафика/ObjectModule.bsl
///Барышникова Ю.А начало доработки 12.11.2024

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьГрафик(ДатаНачала, ДатаОкончания, ВыходныеДни) Экспорт 
	
	Набор = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	
	Набор.Прочитать();
	
	ЧислоСекундВСутках = 86400;
	
	Дат = ДатаНачала;
	
	Для к = 0 По Набор.Количество()-1 Цикл
		
		Запись = Набор[к];
		
		Если Запись.ВКМ_Дата < ДатаНачала Тогда
		    Продолжить;   
		ИначеЕсли Запись.ВКМ_Дата = Дат Тогда
			Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда	
				Запись.ВКМ_Значение = 0;			
			Иначе		          
				Запись.ВКМ_Значение = 8;
			КонецЕсли;
			
			Дат = Дат + ЧислоСекундВСутках;	
		Иначе
			Пока Дат < Мин(Запись.ВКМ_Дата, ДатаОкончания) Цикл
			
				НоваяЗапись = Набор.Добавить();
				НоваяЗапись.ВКМ_Дата = Дат;
				
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					НоваяЗапись.ВКМ_Значение = 0;
				Иначе	          
					НоваяЗапись.ВКМ_Значение = 8;	
				КонецЕсли; 
				
				Дат = Дат + ЧислоСекундВСутках;
				
			КонецЦикла; 
			
			Если Запись.ВКМ_Дата > ДатаОкончания Тогда				
				Прервать;
			Иначе
				Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
					Запись.ВКМ_Значение = 0;
				Иначе	          
					Запись.ВКМ_Значение = 8;
				КонецЕсли;
				
			КонецЕсли;
			
			Дат = Дат + ЧислоСекундВСутках;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Набор.Записать();
	
	Пока Дат <= ДатаОкончания Цикл
		Запись = Набор.Добавить();
		Запись.ВКМ_Дата = Дат;
		
		Если СтрНайти(ВыходныеДни, Строка(ДеньНедели(Дат))) Тогда
			Запись.ВКМ_Значение = 0;	
		Иначе	          
			Запись.ВКМ_Значение = 8;
		КонецЕсли; 
		
		Дат = Дат + ЧислоСекундВСутках;
		
	КонецЦикла; 
	
	Набор.Записать();
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
// конец доработки
